backend/controllers/SiteController.php

    public function actionIndex()
    {
        $settings = Settings::find()->all(); //Вытаскиваем все настройки
        $sitemap['items'] = Item::find()->all(); //Вытаскиваем все позиции товаров
        $sitemap['category'] = ItemCategory::find()->all(); //Вытаскиваем все существующие категории
        $sitemap['page'] = StaticPage::find()->all(); //Вытаскиваем все существующие страницы
---
SELECT * FROM `settings`
SELECT * FROM `item`
SELECT * FROM `item_category`
SELECT * FROM `static_page`

    public function actionEquipment()
    {
        /*-----------------Начинаем построение списка категорий-----------------------*/

        $items = NULL;

        $items = Item::find()->all();

        $allCategories = ItemCategory::find()->where(['sub_id' => NULL])->all(); //Вытаскиваем все родительские категории
---
SELECT * FROM `item`
SELECT * FROM `item_category` WHERE `sub_id` IS NULL

    private function getAllItem($categories)
    {
        $arr = array();

        foreach($categories as $category)
        {
            $getChild = ItemCategory::find()->where(['sub_id' => $category->id])->all();
---
SELECT * FROM `item_category` WHERE `sub_id`=2


            $settings = Settings::findAll([18, 19]); //Вытаскиваем шаблоны short_text и full_text

            $allCategories = ItemCategory::find()->where(['sub_id' => NULL])->all(); //Вытаскиваем все родительские категории
---
SELECT * FROM `item_category` WHERE `sub_id` IS NULL

            $newCategory->short_text = $form->short_text; //Короткий текст
            $newCategory->text = $form->full_text; //Основной текст

            if($newCategory->save())
---
INSERT INTO `item_category` (`sef`, `title`, `description`, `keywords`, `name`, `img`, `sub_id`, `short_text`, `text`) VALUES ('stoly-holodilnye-resto-line', 'Столы холодильные', 'Столы холодильные', 'Столы холодильные', 'Столы холодильные', 'template_menu.jpg', 51, 'Столы холодильные', '<p></p>')

                $catId = $newCategory->id; // ID созданой позиции
            }

            $tags = Tags::find()->all(); //Берем все теги
---
SELECT * FROM `tags`

        }
        else
        {
            $allCategories = ItemCategory::find()->where(['sub_id' => NULL])->all(); //Вытаскиваем все родительские категории
---
SELECT * FROM `item_category` WHERE `sub_id` IS NULL