frontend/controllers/SiteController.php


            $child[] = ['name' => $selectCategory->name, 'sef' => $selectCategory->sef, 'id' => $selectCategory->id, 'active' => true, 'sub' => $tempSub]; //Выбранную категорию сразу добавили в массив вместе с ее субкатегориями

            $partners = ItemCategory::find()->where(['sub_id' => $selectCategory->sub_id])->all(); //Ищем сверстников выбраной категории, у которых такой же sub_id
---
SELECT * FROM `item_category` WHERE `sub_id`=124


            /*------------Начинаем показ Оборудования нашей выбраной категории включая субкатегории----------*/

            $getChild = ItemCategory::find()->where(['sub_id' => $selectCategory->id])->all();
---
SELECT * FROM `item_category` WHERE `sub_id`=125


        while($searchParent == TRUE) //Теперь ищем родителя
        {
            $getParent = ItemCategory::find()->where(['id' => $subId])->one(); //Ищем родительскую категорию
---
SELECT * FROM `item_category` WHERE id IN(112)