frontend/components/Search.php

SELECT * FROM `tags`
---
	public function run()
	{
		$tags = Tags::find()->all();