backend/models/NewCategory.php

INSERT INTO `tags` (`tag_name`) VALUES ('Столы холодильные')
INSERT INTO `tag_linked` (`id_tag`, `id_category`) VALUES (874, 197)
---
        public function newTag($name, $idItem)
    {
        $tag = new Tags();
        $linked = new TagLinked();

        $tag->tag_name = $name;

        if($tag->save())
        {
            $idTag = $tag->id; // ID созданого тега
        }

        $linked->id_tag = $idTag;
        $linked->id_category = $idItem;

        $linked->save();

INSERT INTO `tag_linked` (`id_tag`, `id_category`) VALUES (45, 197)
---
    public function newTagLinked($key, $idItem)
    {
        $linked = new TagLinked();

        $linked->id_tag = $key;
        $linked->id_category = $idItem;

        $linked->save();