backend/models/Newitem.php

INSERT INTO `tags` (`tag_name`) VALUES ('Qwqwqwq')
INSERT INTO `tag_linked` (`id_tag`, `id_item`) VALUES (665, 496)
---
    public function newTag($name, $idItem)
    {
        $tag = new Tags();
        $linked = new TagLinked();

        $tag->tag_name = $name;

        if($tag->save())
        {
            $idTag = $tag->id; // ID созданого тега
        }

        $linked->id_tag = $idTag;
        $linked->id_item = $idItem;

        $linked->save();

INSERT INTO `tag_linked` (`id_tag`, `id_item`) VALUES (665, 498)
---
    public function newTagLinked($key, $idItem)
    {
        $linked = new TagLinked();

        $linked->id_tag = $key;
        $linked->id_item = $idItem;

        $linked->save();